اگر میخواهید در سایت یا اپلیکیشن خود فیلدی باشد که بعد از کلیک به تقویم مراجعه کنید و تاریخ را انتخاب کنید از این کد استفاده کنید

<input class="input_m_form" data-jdp ata-jdp-min-date="1398/11/10" type="text" data-req="0" name="" autocomplete="off" placeholder="">

مورد زیر یعنی تقویم خوان را برای این فیلد فعال کن
data-jdp ata-jdp-min-date="1398/11/10"


حتی اگه فریم ورک یا کلاس سی اس اس شما متفاوت باشه از این کلاس هم بعد از زدن یک فاصله یا اسپیس استفاده کنید
class="yourclass input_m_form"


مورد زیر یعنی پر کردن این فیلد اجباری است
data-req="1"  


مورد زیر یعنی پر کردن این فیلد اجباری نیست
data-req="0"  یا میتواند کلا نباشد