اگر میخواهید در ماژول فرمی بسازید . برای فیلد ها از این حالت استفاده کنید

<input class="input_m_form" type="text" data-req="1" name="name" autocomplete="off" placeholder="">

مورد زیر یعنی پر کردن این فیلد اجباری است
data-req="1"  

مورد زیر یعنی نام این فیلد چیست؟ این نام همان نام ستون در جدول دیتابیس است 
name="write name here"

حتی اگه فریم ورک یا کلاس سی اس اس شما متفاوت باشه از این کلاس هم بعد از زدن یک فاصله یا اسپیس استفاده کنید
class="yourclass input_m_form"

مورد زیر یعنی این فیلد از نوع متن است
type="text"

این یعنی جمله ای که در داخل فیلد به صورت پیشفرض نوشته شده که بعد از کلیک محو میشود
placeholder=""

اگر در فیلد خواستید یک متن پیشفرض از قبل نوشته شده باشه
value=""