را بخوانید و بلد باشید button.php قبل از خواندن این نمونه کد حتما کد
شما باید با ارسال کوئری و عملکرد آن آشنا باشید تا بدانید که ارسال بیش از یک کوئری برای هر درخواست در چه مواردی کاربرد دارد



ما با کد زیر قبلا آشنا شدیم

<a href="#" id="sign_up" data-query="sign_up&second=dog" class="btn_id">'.$read_t['sign_up'].'</a>

 است apple مورد زیر یعنی اولین دیتایی که ارسال میکند کلمه ی 

data-query="apple"


مورد زیر یعنی علاوه بر مورد اول مورد دومی را هم ارسال میکند

data-query="apple&second=dog"
 


صرفا فقط دوبار نیست میتوانید صد کوئری دیگر هم ارسال کنید به همین شکل بالا پشت سر هم به سمت راست

ولی هر کوئری که ارسال کردید برای دریافتش در ماژول از این کد استفاده کنید

به عنوان مثال برای دریافت مورد دوم کوئری مثال بالا به این شکل خواهد بود 

$string =htmlspecialchars($_GET["second"]);


دلخواهی بود second انتخاب نام 



