

اگر یک فرم و فیلد هایی طراحی کردید برای تایید نهایی و ارسال فرم به سابمیت نیاز دارید
از این دکمه استفاده کنید

<a  id="form_submit" data-query="insert_to_(tablename)" data-msg="'.$read_t['switcher'].'" class="btn_id">'.$read_t['switcher'].'</a>

نکته مهم نکته مهم
از این دکمه  برای ماژول های فرزند نمیتونید استفاده کنید برای ماژول های فرزند
از نسخه دوم این استفاده کنید


مورد زیر یعنی این فرم را ثبت میکند و کارایی این دکمه ثبت است
id="form_submit"

مورد زیر یعنی بعد از ثبت دیتا به جدولی با آن نام ارسال میشود
data-query="insert_to_(tablename)" 

در مورد بالا توجه کنید که در فایل سوییچر
یک آرایه به نام زیر وجود دارد
$data_name_list
با این آرایه شما میتوانید نام جدول را جایگزین کنید یعنی اسمی که در اینجا مینویسید در واقع یک سوییچر است برای مسائل امنیتی بهتر است که نام جدول را در سوییچر در آن بخش مشخص کنید . و نامی که در آن بخش دارید را به نام جدول در این بخش بالا استفاده کنید



حتی اگه فریم ورک یا کلاس سی اس اس شما متفاوت باشه از این کلاس هم بعد از زدن یک فاصله یا اسپیس استفاده کنید
class="yourclass btn_id"







