یه ماژول ساختیم و میخوایم بگیم که این ماژول رو چه کسانی میتونن ببینن

کد زیر را بالای هر ماژولی که ساختید اضافه کنید

$Access_p=Access_permission("1",$this->user_level,$this->not_user);


عدد 1 که در کد بالا میبینید یعنی برای دیدن این ماژول یک کاربر حداقل باید عضو باشد یا لاگین شده باشد

عدد یک یعنی حداقل سطح کاربری اش یک باشد . که پایین ترین سطح است

اگر یک ماژول ساختید و میخواهید که فقط ادمین ببینن اول باید مشخص کنید که سطح ادمین چیست .

ترجیحا باید سطح ادمین بالا باشد اگر قرار است سطح ادمین را عدد 2 در نظر بگیریم این کار خوبی نیست ممکن است دیگر نتوانیم سطوح مختلفی بین ادمین و کاربرها ایجاد کنیم


اگر سطح نویسنده های سایت عدد 2 است کد به این شکل میشود

$Access_p=Access_permission("2",$this->user_level,$this->not_user);


اگر سطح کاربری 3 باشد که مثلا به معنی این است که ادمین ارشد است
یا سطح کاربری 12 است یعنی مالک سایت است
یا ادمین ادمین هاست

هر کس عدد بالاتری داشته باشد دسترسی بیشتری دارد

اگر یک ماژول برای سطح 1 تنظیم شده به این معنی است که حداقل برای دیدن این ماژول باید سطح یک را داشته باشید . و به این معنی نیست که فقط کاربرهای سطح یک میتوانند ببینن